[
    {
        "title": "Digital Fellowship 2017",
        "link": "https://workforus.theguardian.com/jobs/kin0000xv?src=DevelopersSite",
        "description": "<p>The Guardian Digital Fellowship is an opportunity for developers who are in the early stages of their careers to join the Digital department. If you love coding and digital media then you can apply to the Fellowship irrespective of your background or experience. </p><p>The Fellowship is a 12 month scheme that offers you an opportunity to ramp up to working as a fully fledged developer in a structured manner, alongside a cohort of Fellows.</p><p>Closing Date for applications: 27th January 2017</p>"
    },
    {
        "title": "Client-side Developer",
        "link": "https://gnm.taleo.net/careersection/ex/jobdetail.ftl?job=KIN00002D&src=DevelopersSite",
        "description": "<p>We're looking for talented, creative, and passionate developers, proficient with CSS, JavaScript, HTML, and modern web development techniques. Comfortable working in a collaborative environment with other developers, Designers, and User Experience architects.</p><p>You will be working with a world class development team, developing with modern web development techniques including progressive enhancement and continuous deployment, modern technology such as React, Angular, ES6, and Sass. You'll also have many opportunities to grow your skills in all areas of web development including working across the stack with Scala, and with our Cloud platform in AWS.</p><p>You'll have the opportunity to work on our award-winning website, with a global audience, supporting our independent and award-winning journalism. We often work closely with our editorial colleagues, and our data and audience insights teams to solve problems.</p>"
    },
    {
        "title": "Software Engineer",
        "link": "https://gnm.taleo.net/careersection/ex/jobdetail.ftl?job=KIN00002J&src=DevelopersSite",
        "description": "<p>We are seeking passionate engineers to work on projects across the Guardian. Our main news website <a href=\"https://www.theguardian.com\">theguardian.com</a>, which serves millions of readers each day, has traffic peaks of up to 1200 pages per second and close to 100% uptime. Our Open Platform makes our content available not just to our internal websites and mobile applications but also many other partners and developers.</p><p>We have many projects in progress simultaneously and our teams are given the autonomy to choose the right technologies to solve their problems. Our core platforms are Scala, JavaScript, <a href=\"http://www.playframework.com/\">Play</a> and Amazon Web Services.</p><p>Our developers are continually developing their skills and are eager to learn new things, displaying the aptitude to change and respond to a changing news situation. They are at the forefront of our work to create a Guardian for the new century.</p>"
    },
    {
        "title": "Senior software engineer",
        "link": "https://gnm.taleo.net/careersection/ex/jobdetail.ftl?job=KIN00006Q&src=DevelopersSite",
        "description": "<p>Senior engineers are experienced developers with a variety of experience across domains and technologies. They have established their own areas of knowledge and expertise but are willing to share what they know and are always eager to learn new things.</p><p>They are humble and moderate in their views. Happy to mentor a junior developer, capable of leading a team or supporting one of their peers to deliver a shared technical vision. They see the world in terms of potential solutions, not problems. They support their opinions with data and metrics rather than rhetoric. They find out how to delight our journalists and readers and deliver the things that really matter to our organisation.</p>"
    },
    {
      "title": "Software Engineer - tools, automation, process",
      "link": "https://gnm.taleo.net/careersection/ex/jobdetail.ftl?job=KIN0000N1",
      "description": "<p>Guardian News & Media Ltd. is seeking a technical, motivated and open minded colleague to join our highly respected, but relaxed Digital Development team as a Software Engineer - tools, automation, process.  You’ll be pivotal in helping shape the culture of a product team, and in embedding quality throughout the whole process of software development. As well as leading the development of innovative automated solutions to improve our products’ quality, you’ll be finding and researching new techniques and tools and leading discussion with the team about how and where we can use them</p> <p>We are not looking for someone whose ambition is to spend vast amounts of time creating and maintaining automated UI tests. We are looking someone who is excited at the prospect of getting the whole team thinking about quality, by suggesting and developing automated solutions and tooling to facilitate this, but also about having the time to think more creatively about things that might influence the quality of our products. Here at the Guardian we are redefining the traditional approach to QA: relying less on traditional manual and automated UI testing processes; instead ensuring overall product quality through improving automation, tooling, and process - within an agile team operating under rapid deployment cycles.</p>"
    }
]
